#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.repository["tools"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Reading...
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
github_repository.lib_template_rust: Refreshing state... [id=template-rust-lib]
module.repository["website"].data.github_team.owner: Reading...
module.repository_rust_svc["scheduler"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
github_repository.svc_template_rust: Refreshing state... [id=svc-template-rust]
module.tf_repository["github"].github_repository.repository: Refreshing state... [id=tf-github]
github_repository.svc_template_python: Refreshing state... [id=svc-template-python]
module.repository["website"].data.github_team.owner: Read complete after 2s [id=5490296]
module.tf_repository["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
github_repository.svc_template_typescript: Refreshing state... [id=svc-template-typescript]
module.tf_repository["onboarding"].data.github_team.owner: Reading...
module.tf_repository["github"].data.github_team.owner: Reading...
module.repository_rust_lib["router"].data.github_team.owner: Reading...
github_team_repository.lib_template_rust_maintainer: Refreshing state... [id=6311795:template-rust-lib]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository["tools"].data.github_team.owner: Read complete after 4s [id=6203057]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository_rust_svc["storage"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository_rust_svc["scheduler"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["clabot-config"].data.github_team.owner: Read complete after 5s [id=6029505]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository["cla-bot"].data.github_team.owner: Read complete after 5s [id=6029505]
github_team_repository.svc_template_rust_maintainer: Refreshing state... [id=6311795:svc-template-rust]
github_team_repository.svc_template_python_maintainer: Refreshing state... [id=6311795:svc-template-python]
module.tf_repository["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.tf_repository["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.tf_repository["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.tf_repository["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
github_team_repository.svc_template_typescript_maintainer: Refreshing state... [id=6311795:svc-template-typescript]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.tf_repository["onboarding"].data.github_team.owner: Read complete after 5s [id=6029505]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.tf_repository["github"].data.github_team.owner: Read complete after 5s [id=6311795]
module.tf_repository["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.tf_repository["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository_rust_lib["router"].data.github_team.owner: Read complete after 6s [id=6311795]
module.tf_repository["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.tf_repository["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.tf_repository["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.tf_repository["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.tf_repository["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"88d2d9e5885e4f760bfb64fda25dc385ed6e987a34419ce3b0435cdd7e670388\"" -> "W/\"53ba7109d9cf6e736bc48eae70eaeed3ce1844aaf4984e13b4c46990b86dde80\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "lib-router"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_lib["router"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "lib-router"
    }

  # module.repository_rust_lib["router"].github_branch_protection.all["lib-router"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "lib-router"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "lib-router"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "lib-router"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_lib["router"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Arrow Libraries - Fleet Routing Algorithm Library"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "lib-router"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "Arrow-air"
          + repository = "template-rust-lib"
        }
    }

  # module.repository_rust_lib["router"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}\n" # should be visible in the console when doing a git commit
            
            set -e
            
            # RUST
            echo "${YELLOW}Running cargo tests...${NC}"
            cargo test --all
            echo "${YELLOW}Linting Rust codes through clippy...${NC}"
            cargo clippy --all -- -D warnings
            echo "${YELLOW}Running and checking Rust codes formats...\n${NC}"
            cargo fmt --all -- --check
            
            # PYTHON 3
            echo "${YELLOW}Formatting and checking Python files with Google style...\n${NC}"
            yapf -r -i -vv . style google
            echo "${YELLOW}Formatting and checking Python files with flake8 style...\n${NC}"
            flake8 .
            
            
            # Style Check
            echo "${YELLOW}Checking if the codebase is compliant with the .editorconfig file...\n${NC}"
            ec
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!\n${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
                "-Wmissing_docs",
                "-Wmissing_debug_implementations",
                "-Wmissing_copy_implementations",
                "-Wtrivial_casts",
                "-Wtrivial_numeric_casts",
                "-Wunsafe_code",
                "-Wunstable_features",
                "-Wunused_import_braces",
                "-Wunused_qualifications"
                ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: EditorConfig-Action
                  uses: editorconfig-checker/action-editorconfig-checker@main
                - run: editorconfig-checker
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            # env:
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: YAPF for proper formatting
                  run: |
                    python3 -m pip install -r requirements.txt
                    yapf -r -i -vv . style google
            
              flake8-lint:
                runs-on: ubuntu-20.04
                name: Lint
                steps:
                  - name: Check out source repository
                    uses: actions/checkout@v2
                  - name: Set up Python environment
                    uses: actions/setup-python@v2
                    with:
                      python-version: "3.10"
                  - name: flake8 Lint
                    uses: py-actions/flake8@v2
                    with:
                      # ignore: "F401"
                      exclude: "src/ignoreme.py"
                      max-line-length: "100"
                      path: "src"
                      plugins: "flake8-bugbear==22.1.11 flake8-black"
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              RUST_VERSION: 1.62.0
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - uses: actions-rs/cargo@v1
                    with:
                      command: check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-20.04
                env:
                    RUSTC_BOOTSTRAP: 1
                    CARGO_INCREMENTAL: 0
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
            
                  - name: Build
                    run: cargo build
            
                  - name: Test
                    run: cargo test
            
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add rustfmt
                  - uses: actions-rs/cargo@v1
                    with:
                      command: fmt
                      args: --all -- --check
            
              clippy:
                name: Clippy
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add clippy
                  - uses: actions-rs/cargo@v1
                    with:
                      command: clippy
                      args: -- -D warnings
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            Cargo.lock
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "lib-router"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_lib["router"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "lib-router"
      + team_id    = "services"
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-scheduler"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-scheduler"
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-scheduler"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-scheduler"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-scheduler"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["scheduler"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Arrow Services - Fleet Routing and Flight Planner"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "svc-scheduler"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "Arrow-air"
          + repository = "svc-template-rust"
        }
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}\n" # should be visible in the console when doing a git commit
            
            set -e
            
            # RUST
            echo "${YELLOW}Running cargo tests...${NC}"
            cargo test --all
            echo "${YELLOW}Linting Rust codes through clippy...${NC}"
            cargo clippy --all -- -D warnings
            echo "${YELLOW}Running and checking Rust codes formats...\n${NC}"
            cargo fmt --all -- --check
            
            # PYTHON 3
            echo "${YELLOW}Formatting and checking Python files with Google style...\n${NC}"
            yapf -r -i -vv . style google
            echo "${YELLOW}Formatting and checking Python files with flake8 style...\n${NC}"
            flake8 .
            
            
            # Style Check
            echo "${YELLOW}Checking if the codebase is compliant with the .editorconfig file...\n${NC}"
            ec
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!\n${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
                "-Wmissing_docs",
                "-Wmissing_debug_implementations",
                "-Wmissing_copy_implementations",
                "-Wtrivial_casts",
                "-Wtrivial_numeric_casts",
                "-Wunsafe_code",
                "-Wunstable_features",
                "-Wunused_import_braces",
                "-Wunused_qualifications"
                ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: EditorConfig-Action
                  uses: editorconfig-checker/action-editorconfig-checker@main
                - run: editorconfig-checker
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            # env:
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: YAPF for proper formatting
                  run: |
                    python3 -m pip install -r requirements.txt
                    yapf -r -i -vv . style google
            
              flake8-lint:
                runs-on: ubuntu-20.04
                name: Lint
                steps:
                  - name: Check out source repository
                    uses: actions/checkout@v2
                  - name: Set up Python environment
                    uses: actions/setup-python@v2
                    with:
                      python-version: "3.10"
                  - name: flake8 Lint
                    uses: py-actions/flake8@v2
                    with:
                      # ignore: "F401"
                      exclude: "src/ignoreme.py"
                      max-line-length: "100"
                      path: "src"
                      plugins: "flake8-bugbear==22.1.11 flake8-black"
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              RUST_VERSION: 1.62.0
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - uses: actions-rs/cargo@v1
                    with:
                      command: check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-20.04
                env:
                    RUSTC_BOOTSTRAP: 1
                    CARGO_INCREMENTAL: 0
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
            
                  - name: Build
                    run: cargo build
            
                  - name: Test
                    run: cargo test
            
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add rustfmt
                  - uses: actions-rs/cargo@v1
                    with:
                      command: fmt
                      args: --all -- --check
            
              clippy:
                name: Clippy
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add clippy
                  - uses: actions-rs/cargo@v1
                    with:
                      command: clippy
                      args: -- -D warnings
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            # Cargo.lock
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-scheduler"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_svc["scheduler"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "svc-scheduler"
      + team_id    = "services"
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-storage"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-storage"
    }

  # module.repository_rust_svc["storage"].github_branch_protection.all["svc-storage"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-storage"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-storage"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-storage"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["storage"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Arrow Services - Storage module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "svc-storage"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "Arrow-air"
          + repository = "svc-template-rust"
        }
    }

  # module.repository_rust_svc["storage"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}\n" # should be visible in the console when doing a git commit
            
            set -e
            
            # RUST
            echo "${YELLOW}Running cargo tests...${NC}"
            cargo test --all
            echo "${YELLOW}Linting Rust codes through clippy...${NC}"
            cargo clippy --all -- -D warnings
            echo "${YELLOW}Running and checking Rust codes formats...\n${NC}"
            cargo fmt --all -- --check
            
            # PYTHON 3
            echo "${YELLOW}Formatting and checking Python files with Google style...\n${NC}"
            yapf -r -i -vv . style google
            echo "${YELLOW}Formatting and checking Python files with flake8 style...\n${NC}"
            flake8 .
            
            
            # Style Check
            echo "${YELLOW}Checking if the codebase is compliant with the .editorconfig file...\n${NC}"
            ec
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!\n${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
                "-Wmissing_docs",
                "-Wmissing_debug_implementations",
                "-Wmissing_copy_implementations",
                "-Wtrivial_casts",
                "-Wtrivial_numeric_casts",
                "-Wunsafe_code",
                "-Wunstable_features",
                "-Wunused_import_braces",
                "-Wunused_qualifications"
                ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: EditorConfig-Action
                  uses: editorconfig-checker/action-editorconfig-checker@main
                - run: editorconfig-checker
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            # env:
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: YAPF for proper formatting
                  run: |
                    python3 -m pip install -r requirements.txt
                    yapf -r -i -vv . style google
            
              flake8-lint:
                runs-on: ubuntu-20.04
                name: Lint
                steps:
                  - name: Check out source repository
                    uses: actions/checkout@v2
                  - name: Set up Python environment
                    uses: actions/setup-python@v2
                    with:
                      python-version: "3.10"
                  - name: flake8 Lint
                    uses: py-actions/flake8@v2
                    with:
                      # ignore: "F401"
                      exclude: "src/ignoreme.py"
                      max-line-length: "100"
                      path: "src"
                      plugins: "flake8-bugbear==22.1.11 flake8-black"
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              RUST_VERSION: 1.62.0
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - uses: actions-rs/cargo@v1
                    with:
                      command: check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-20.04
                env:
                    RUSTC_BOOTSTRAP: 1
                    CARGO_INCREMENTAL: 0
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
            
                  - name: Build
                    run: cargo build
            
                  - name: Test
                    run: cargo test
            
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add rustfmt
                  - uses: actions-rs/cargo@v1
                    with:
                      command: fmt
                      args: --all -- --check
            
              clippy:
                name: Clippy
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add clippy
                  - uses: actions-rs/cargo@v1
                    with:
                      command: clippy
                      args: -- -D warnings
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            # Cargo.lock
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-storage"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_svc["storage"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "svc-storage"
      + team_id    = "services"
    }

  # module.tf_repository["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.tf_repository["github"].github_repository_webhook.map["discord"] will be updated in-place
  ~ resource "github_repository_webhook" "map" {
        id         = "372087606"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ url          = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

  # module.tf_repository["onboarding"].github_repository_webhook.map["discord"] will be updated in-place
  ~ resource "github_repository_webhook" "map" {
        id         = "372087608"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ url          = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 54 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"88d2d9e5885e4f760bfb64fda25dc385ed6e987a34419ce3b0435cdd7e670388\"" -> "W/\"53ba7109d9cf6e736bc48eae70eaeed3ce1844aaf4984e13b4c46990b86dde80\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @owlot, Action: `pull_request`*